#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "e5102e5d2d2131c1ac7fb35ff1be271b" -> "44656c5b9d8f2312e53ec8f93ac806a6"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "7c4b49ebe9e5c3df769531d7e687479a" -> "fa92fe871b93124ca9b6a119b00036d9"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "bd35d83cef6116721aedec1af50aaaa7" -> "7db41abc4a5a59d303461be9317827ab"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "47b93eaf9ac49534768ccb7569331a86" -> "862a2c60ee68223db4d0a9ba29fe577c"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "401716f362658cc86f46577cdf4f99d2" -> "191173a076df09b33491d515b62c5282"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "8fdbfb0f806ef72108c7a531a256df8f" -> "b23ebe79a555c5880ca2018a253cb44f"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "516d79243354d0e72f6c6811da67d9f8" -> "32651a17cb6f07d8a39638687f4f151c"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "b31281b5521bb25d85fcac0c95914b92" -> "dcad0e3c9ed716f2df6938ce92181033"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "cc1bc2f34d920326b33acc97aadf091f" -> "b16a2a0d168f03cd116d880921093f81"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "ff603748c2d6c71f7a18f4c029a33f47" -> "5e039f9bb659a6e3e948169caccfe9f3"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "33c2622c2f09fb1c1a83a958ef41582b" -> "07a3a1252f62298fe715a81f80aeeaf2"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "8704b87ee98b96d264223303cbdc6458" -> "1addf1ce78ce19482a97ae0d268cc625"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "c05aed5a3557873633e971ed79dd2fbe" -> "bd69d421c16879d00c8374131a4b9ad9"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "f13b9f2c869c48b7919217b8cbe8ff0f" -> "e4cb9151829344c253512921cf5c2a1d"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "8d46fdbe3d3677f41aa85b3f2499c790" -> "b5e067596688e266f0615f28a11e652c"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "446c8a25757a78de7151a445c85087a3" -> "9c32a0e9b4025c86a8c092458c2ee98e"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "95ed55165ee0e705aa583572ced54e85" -> "987e2d66c061803cba9e597949c38103"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "7ba6cb08dadd42f613b4c1c5682c7187" -> "d8bccfab45215c0edbc2e68d8b80ba31"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "3dc167bbe834c3b5ef3f248fcedefe7a" -> "382a9a11705d97601327c95b86125cf4"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "bd2cfac8e30be6943a716c25cba4a76f" -> "0e3b0069e47d2df9ccb878e65663ea29"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "461dec0e7fab40daad6e4b7e849ca8f9" -> "c896dd866b69585637e5e6a647db02b9"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "f840bc1c0243a2a8ee6a0c247ef01d56" -> "005b163dd090082ac0562ee3687f6a22"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "541cf38eb339a11f361b89dc5297eeaf" -> "ccf6b2ebca382dbc8e37fff19f91566c"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "72b383a9fb7c76f1b0917b0d3e502d6e" -> "2dbb37bb4fb1fe97d11da5d53d5cff1f"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "551266ef506784ab14a157df2878c91f" -> "629bbcec8ae5baba6bca3ce725a9e1ea"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "e9002274c19e84daa709d655bd71f994" -> "e762a8873a27bfc55a6901c86e5ab44b"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "e4c35268c94f27a4b5c1b2802267574f" -> "b1b34f238efc9912b5fd4f71463dbba7"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "473e502195dbc8ee8e6e41808f2a380f" -> "048ccc95fd8ed7d3b49fbad2375e6f68"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "543a3d9a58f7df27c7e1fcccef060405" -> "f214ccbba5023f5a8de0586211723a07"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "ce6ef02520743aa51b750c7b1b5715d9" -> "767b4ab13ee9aa66e7ef3eb9d3449bd5"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "05b1411d17444ec54992d6cc667049cd" -> "4a321327443b3710b9aeac9204a8b29b"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "1a57ebe72827130e59a5e5f25ce0f9db" -> "f30fcfcf1e610427bfe1b1937096b495"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "6a8ddb3f12daf1739cea91dca005128b" -> "e62d140117341bfafd7f43adb3669930"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "a4764ea5fe5e06796de976dc94bae7f8" -> "2c833b3de2ae557b8e8b83ffb70a9717"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "08ec8493fa1cfeb105e3574738f3d7ff" -> "827fda3a538b516471fe384a2d5bc586"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "f154faab5b009454e797d9eb3982ebb9" -> "6ba0d5ae7c6a37758b5252a65d6e7bb8"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "0e027d47705720d54c82bbc297831eb8" -> "2e8d299ca898b1093a4f6a0973f3026e"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "c7dd560f367ece5ace365baf143dcdd2" -> "7b3425ff37687dc17775e2d47a7835c4"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "f057c779bb8f7dfb1e17122e68ba6b54" -> "6492da38186f0ef3a5c4cec1b3adea2e"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "20bf69ab8d839ab4a954dd43dcc48378" -> "3003a93652f6d2d2b8344a81a6fb040e"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "97a41b847a3a1084c0f8648e50cbf8af" -> "eec23b47df90833b3792113fb8538220"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "e33738e04ef47a78aaa14d575d51bb7d" -> "541b86e243aa91e59057b390cb123088"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "H+/ZDTtxe1whMZloZOeitkC9AmBkQSbYve32Vbu8Hfk=" -> "ihJ4fBTkeyKUNJoJC+PbZYrzyHb+czTBbcT300EjJps="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "04uCD0JmvzGjj508uB6X+md+dTMb+C0fGG/lkOKMG+c=" -> "8GMwTlEeei6bJsZXnUAfKV2Xd46jdmCeBcWQu4Ai+XQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "MmUGEJKjvTAeHIBQZO+4nj++mc4dpMAFi0vnXsdbqdo=" -> "Vx51AkMh5nHKAMQEFFxlGoLsaw6SdWFhDynqtNkP63Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "n6NnpOWdI+uLI+RneayaqpnVonsPvqOuGVk6mEtVth0=" -> "+fqZVV4b/Fqe5jvpb4wMmj8yyEH2LJo1xWpWSm//6UQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "5VZuMdNpXQ7YoYYK47Lg0LNHl5505NHAEwh4sbvbwag=" -> "vfsR54k6kO2euXvfWTxZrL6Z2bPlruBWLz1corZZ5ZI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "GWly7tWQihHRjRIXPSis3RJm38Wem5JgfhrkBlFwJlw=" -> "ysHAPp67DUiWiUh8iixxXc+GlWjdu6RioqqDo+FOfkU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "HPAzrTZOJjEPsiIAsjzQU8iy2i786ZorlZkXLuAcSyQ=" -> "Jsaq4jk+Gm8nkaO4naVkSuUqAUH1ii6q5hkIyhmdLeg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "DMeWtHMOC1BjUr3sefDJDWWS57Ap0dLNmrX1FG+s/LY=" -> "LLfeT5elO/DvenQmAwpEFGs56t6/0Nu8rQkSl3sw22c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "DM0JZyLfsFnfrQgSRMbkuILgTvo3LNX9kit/Gi7ydew=" -> "+LhEccwhHV/PR7vNh8LIQP6xz1pRs63PuAOcV7MidUU="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "2+m+/cWQMUIKy+fo+4OB4K1l3ZxUp3dQp5XvksN9GMo=" -> "tr/7+62f7rgrO2S4dpRw0vSL72fl78bL47oN4vYaUjc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "WVn3zj9jKUHuumGyNVW8BDeuN2ME4IgTHcMX2b9V2/4=" -> "ol2SS0GJ+RXf/6Op0UwlGfILtzsPQeS5+qNMsW8GRgY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "FbVFf9Vfc46LKIAnmyidkZS1GlYUHUoVV1RsT2cVnU4=" -> "XI2cGHu7GopLzlmarmKJFxyf3tqacqx5P93Rv2kfiRk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "YFiltjCE0rvZUvV/taLDGzmFlskOemjhncrYZt22uHw=" -> "0zSH8hCCIJMpp6LUDFJCuLRQvU7ec15/4SIzW1TA9qk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "1LYjOtKjdkSpFOzqIDIVSK/iXUFWv5KcQClBuKh09mg=" -> "HJ5UGnihk3+6EablkhRbgurkW+VII4470wkG0FxKshM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "PGCZn/GJ+XDG4Ba+YH8jDqAdcq58U58T6n3ckycj5To=" -> "nMIy5pUJyAesboCkdqqauKdOm3fzJyW2hdWG5LVEriY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "4f+A+bLRkHiTzElsAeI34OJxHRFqWtG5joZoocyeo+o=" -> "P8w32JNKcc+DFEmaEi6FJwtH5bdXsN9Bbx4bFzk0pDs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "L5ktIsA1pAoOY9FmKjHpdiuKCyWSLFodRabjBWSFFpY=" -> "FoJFa4Vl7SnBSOVUaSDxftuYMiYvFAzUvqPdrMjhCKY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "oK9LG76YFtqihOwxWLDeYHwbR1EkW38NgrJjMGep5Z8=" -> "T/VmgU9YCi8uc4XPnbZYZa7D0g3Vj4uBrpQ2jqudfwM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "ak/hdCTLlXcH0S7SO/NvM8WuADNvMha3fGesitP4Xpo=" -> "GK4n61UgBJqfJdWHS0YCdvwouH8yTgF2gGH4SizDj80="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "VcG9y34cDs2rt2HXEP123k0mAkdULR+eeTHbm0XVRP4=" -> "vUaxDbVjYtBMP24FXzrZlRtKqC5zszcWokZ8vrywDlw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "c89KlKJXkzSzCOngHZkphzt9Ud95QgyZ4oAP67zKCb0=" -> "k8R9gmjjxLfDsbH7fhAYt0pJt51vZPBy2KubRSK/KSM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "Gco9t5wErgPIWRMDUn9z60QVIWBgEYOK60eXeXGUYlk=" -> "2WQnJiB5UPA3k8tPoj4CytV8kAf/SX8E2vR5d4r7xIo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "KnGmKfeOyYaHBb4LBaeoEJSKUXHhPOGzpvSmflDBb78=" -> "GJUIVAEbMS6uJsLxauWFwuhq016m5UkYwJgG34Kd8bk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "mk3m3zh10FVYhCwjiOlVO3TA2wQbM6wKfOuGnHWeJeI=" -> "leqVDpEf/9KYGLHvcfP+L0Va453u3FDzurQ8oG5S+y4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "2/JrsXk2/UUKz1PLt2GQge/mL1S/frdZVXGo65rz3s4=" -> "KrcUpgL450V4W/SM085eaw2u92GSXzOBtJt8zWIm7oI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "00YWuo55g+VGYJjJhhfWqRTocuobo4bRDiWmjcUYzOs=" -> "9nBgmaN3ZDBqA9WPtsj24UQPMe+LtnijgCMfu0mRf9s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "S16P6gOkGURhl7uZt7ntivb3idvbYv/ikAXZdU/AehU=" -> "DqRbb9BKTIIwdV13RB7rrVR/UdjdXUOEuK4R0yHyU8c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "+ha4zL/gBSswYHPgYwRvzGCkwJ8aY+vvb7pjBq0efoo=" -> "EhAMXoOY/RCfu/AeWevwCnd2q2y1vY1E0A+iyRJ25po="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "Xw5ld5fZ7Gm0/PgI5JrMXXK+M6lX/wt3nXDdpogp1DY=" -> "dPP0wRnMTsdxtYrA4wuTuF329rW2JCcl4ODldjG8V9A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "lP5LhAFHF7N4maIK5UmYaQZfItEsXuKGyDh15PRY0wk=" -> "tH+JqE90fWao6uBf/A8q77rIsQu8DzJlzHmhVGcCMm4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "sWfwI4v62jcXu9xfFMoEmJYyr3TOTMldu/eY6u/Ting=" -> "6z+nzRBHBmmWGKycH5OznOeLx4crHfuvsOH7O0JXOmM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "DooeVwoiU35xN2SwSDJwhYpsP7haZEK1v4arJzY/KOk=" -> "et7qohux68tjJ+aZuzgZUBHhIf+i/CsEEBmYIQrE6DQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "ER/m/qeQatL5+1SaiNcziiyLzgW7w/9EdfB5n27Xcvw=" -> "UZmnZ2aswBJ8T+MVE/ZlVLgdZBrlv1+20TcKxY0CeOk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "ewmUcPgBC4DIF2ZBYGfunW0FWiURq9GQdWLcm9MCo2g=" -> "T2Qc/NkwgXo7fsFCHQWBW+88WEXzh8X8lnf09luHMhg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "amsBQTXjqo8zWeAOXSTIgOXUarQnN0/FUbQz8EjIVYs=" -> "HLVMuZ8u730A9Md0nPCiZVbIY2uPjwT1gV7Kj6bAaPg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "2i85bqr31qP5Ri0lzArhBgJa4Jf8ep1stiAvws1EzsE=" -> "kUmprSkPB/+zRXNTkASVf6n3REEaI52T/pmoUJkJuvQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "njqq9bXYrmKDA1Xccy6APCYJwWpJ4IdYtz4OSPEk7Ac=" -> "iRrJLXwBpcEfeUKLsUdb+StsPWN1pNwnXAPBKy9D854="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "9VVs4VrF88Ja1uyt9UZ/yeJOPzamTRe3nSt9HDv2bFs=" -> "RPgOcYjRsMFStg9s6KTl2e5Q03Au887E04FGUVevBPU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-21T17:17:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "HWUxgkDvYeAMhX/0npP8JeHmwQ27hoZ/hmRLKm5aupo=" -> "DkCVBgJhCgqvOtpmoqKJcNHW1EoI0rtLKCdnTfy4rp4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "wxZD1baRonwymXiwMjWb5Wv6hvagldj3TiV3xePJA+Q=" -> "ePYVVx/czpWFkz9Z3d9Zk8eHUBxiLFJXxBmWAHXSyEk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-21T17:16:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z2Gn7+c0WD9oEJruyK+iBoEDKWgKKSxw5lDbiacAttE=" -> "4YpLSerpFYhgARal7RK4VWhTKaFarcs3zzPw29ynMwc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-21T17:16:55Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "r57vbn" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-21T17:16:54Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-21T17:17:42Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 85 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*